experiments/01_simple_laminar/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Parabolic (Hagen-Poiseuille) inlet velocity profile — constant in time.
//
// u(r) = 2·U_mean · (1 − r²/r₀²)
//
// Parameters:
//   U_mean = 0.031 m/s   (3.1 cm/s)
//   U_max  = 0.062 m/s   (centreline peak = 2 · U_mean)
//   r₀     = 0.0005 m    (vessel radius, 1 mm diameter)
//   r²     = y² + z²     (radial distance in the y-z cross-section)
//
// Re = U_mean · D / ν = 0.031 · 0.001 / 3.3e-6 ≈ 9.4  (very laminar)

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            codedFixedValue;
        value           uniform (0 0 0);   // placeholder — overwritten at runtime
        name            parabolicInletVelocity;

        code
        #{
            const vectorField& Cf   = this->patch().Cf();
            const scalar       R    = 0.0005;  // vessel radius [m]
            const scalar       Umax = 0.062;   // 2 * U_mean [m/s]

            vectorField& field = *this;
            forAll(Cf, faceI)
            {
                const scalar r2 = sqr(Cf[faceI].y()) + sqr(Cf[faceI].z());
                field[faceI] = vector(Umax * (1.0 - r2 / sqr(R)), 0.0, 0.0);
            }
        #};
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            noSlip;
    }
}

// ************************************************************************* //
